# Pandas - Missing Data

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
d = {'A':[1, 2, np.nan], 'B':[4, np.nan, np.nan], 'C': [7, 8, 9]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [6]:
df.dropna()

     A    B  C
0  1.0  4.0  7

In [7]:
df.dropna(axis=1)

   C
0  7
1  8
2  9

In [9]:
# It require minimum two NaN values to drop row
df.dropna(thresh=2)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8

In [10]:
# Fill values
df.fillna(value="FILL")

      A     B  C
0   1.0   4.0  7
1   2.0  FILL  8
2  FILL  FILL  9

In [11]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [12]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9